library {
  function {
    signature {
      name: "__inference_while_cond_14445_18581"
      input_arg {
        name: "while_loop_counter"
        type: DT_INT32
      }
      input_arg {
        name: "while_maximum_iterations"
        type: DT_INT32
      }
      input_arg {
        name: "placeholder"
        type: DT_INT32
      }
      input_arg {
        name: "placeholder_1"
        type: DT_VARIANT
      }
      input_arg {
        name: "placeholder_2"
        type: DT_FLOAT
      }
      input_arg {
        name: "placeholder_3"
        type: DT_FLOAT
      }
      input_arg {
        name: "less_strided_slice"
        type: DT_INT32
      }
      input_arg {
        name: "while_cond_14445___redundant_placeholder0"
        type: DT_VARIANT
      }
      input_arg {
        name: "while_cond_14445___redundant_placeholder1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "while_cond_14445___redundant_placeholder2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "while_cond_14445___redundant_placeholder3"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_BOOL
      }
    }
    node_def {
      name: "Less"
      op: "Less"
      input: "placeholder"
      input: "less_strided_slice"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "Less"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "Less:z:0"
      attr {
        key: "T"
        value {
          type: DT_BOOL
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
  }
  function {
    signature {
      name: "__inference_lstm_layer_call_fn_22981"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_3"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "StatefulPartitionedCall"
    }
    node_def {
      name: "StatefulPartitionedCall"
      op: "StatefulPartitionedCall"
      input: "inputs"
      input: "statefulpartitionedcall_args_1"
      input: "statefulpartitionedcall_args_2"
      input: "statefulpartitionedcall_args_3"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003GPU\020\000\n\007\n\003CPU\020\0012\002J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_lstm_layer_call_and_return_conditional_losses_22973"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "StatefulPartitionedCall"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "StatefulPartitionedCall:output:0"
      input: "^StatefulPartitionedCall"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    control_ret {
      key: "StatefulPartitionedCall"
      value: "StatefulPartitionedCall"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_lstm_layer_call_fn_22017"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_3"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "StatefulPartitionedCall"
    }
    node_def {
      name: "StatefulPartitionedCall"
      op: "StatefulPartitionedCall"
      input: "inputs"
      input: "statefulpartitionedcall_args_1"
      input: "statefulpartitionedcall_args_2"
      input: "statefulpartitionedcall_args_3"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003GPU\020\000\n\007\n\003CPU\020\0012\002J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_lstm_layer_call_and_return_conditional_losses_22009"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "StatefulPartitionedCall"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "StatefulPartitionedCall:output:0"
      input: "^StatefulPartitionedCall"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    control_ret {
      key: "StatefulPartitionedCall"
      value: "StatefulPartitionedCall"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference___backward_cudnn_lstm_with_fallback_16613_20873"
      input_arg {
        name: "placeholder"
        type: DT_FLOAT
      }
      input_arg {
        name: "placeholder_1"
        type: DT_FLOAT
      }
      input_arg {
        name: "placeholder_2"
        type: DT_FLOAT
      }
      input_arg {
        name: "placeholder_3"
        type: DT_FLOAT
      }
      input_arg {
        name: "placeholder_4"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_strided_slice_grad_shape_cudnnrnn"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_strided_slice_grad_stridedslicegrad_strided_slice_stack"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_strided_slice_grad_stridedslicegrad_strided_slice_stack_1"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_strided_slice_grad_stridedslicegrad_strided_slice_stack_2"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_9_grad_invertpermutation_transpose_9_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_squeeze_grad_shape_cudnnrnn"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_squeeze_1_grad_shape_cudnnrnn"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_zeros_like_cudnnrnn"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_cudnnrnn_grad_cudnnrnnbackprop_transpose"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_cudnnrnn_grad_cudnnrnnbackprop_expanddims"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_cudnnrnn_grad_cudnnrnnbackprop_expanddims_1"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_cudnnrnn_grad_cudnnrnnbackprop_concat_1"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_transpose_grad_invertpermutation_transpose_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_expanddims_grad_shape_init_h"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_expanddims_1_grad_shape_init_c"
        type: DT_FLOAT
      }
      input_arg {
        name: "gradients_concat_1_grad_mod_concat_1_axis"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_1_grad_invertpermutation_transpose_1_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_2_grad_invertpermutation_transpose_2_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_3_grad_invertpermutation_transpose_3_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_4_grad_invertpermutation_transpose_4_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_5_grad_invertpermutation_transpose_5_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_6_grad_invertpermutation_transpose_6_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_7_grad_invertpermutation_transpose_7_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_transpose_8_grad_invertpermutation_transpose_8_perm"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_split_2_grad_concat_split_2_split_dim"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_split_grad_concat_split_split_dim"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_split_1_grad_concat_split_1_split_dim"
        type: DT_INT32
      }
      input_arg {
        name: "gradients_concat_grad_mod_concat_axis"
        type: DT_INT32
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity_1"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity_2"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity_3"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity_4"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity_5"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "gradients/CudnnRNN_grad/CudnnRNNBackprop"
    }
    node_def {
      name: "gradients/grad_ys_0"
      op: "Identity"
      input: "placeholder"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/grad_ys_0"
      }
    }
    node_def {
      name: "gradients/grad_ys_1"
      op: "Identity"
      input: "placeholder_1"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/grad_ys_1"
      }
    }
    node_def {
      name: "gradients/grad_ys_2"
      op: "Identity"
      input: "placeholder_2"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/grad_ys_2"
      }
    }
    node_def {
      name: "gradients/grad_ys_3"
      op: "Identity"
      input: "placeholder_3"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/grad_ys_3"
      }
    }
    node_def {
      name: "gradients/grad_ys_4"
      op: "Identity"
      input: "placeholder_4"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/grad_ys_4"
      }
    }
    node_def {
      name: "gradients/strided_slice_grad/Shape"
      op: "Shape"
      input: "gradients_strided_slice_grad_shape_cudnnrnn"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/strided_slice_grad/Shape"
      }
    }
    node_def {
      name: "gradients/strided_slice_grad/StridedSliceGrad"
      op: "StridedSliceGrad"
      input: "gradients/strided_slice_grad/Shape:output:0"
      input: "gradients_strided_slice_grad_stridedslicegrad_strided_slice_stack"
      input: "gradients_strided_slice_grad_stridedslicegrad_strided_slice_stack_1"
      input: "gradients_strided_slice_grad_stridedslicegrad_strided_slice_stack_2"
      input: "gradients/grad_ys_0:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 1
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/strided_slice_grad/StridedSliceGrad"
      }
    }
    node_def {
      name: "gradients/transpose_9_grad/InvertPermutation"
      op: "InvertPermutation"
      input: "gradients_transpose_9_grad_invertpermutation_transpose_9_perm"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/transpose_9_grad/InvertPermutation"
      }
    }
    node_def {
      name: "gradients/transpose_9_grad/transpose"
      op: "Transpose"
      input: "gradients/grad_ys_1:output:0"
      input: "gradients/transpose_9_grad/InvertPermutation:y:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tperm"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/transpose_9_grad/transpose"
      }
    }
    node_def {
      name: "gradients/Squeeze_grad/Shape"
      op: "Shape"
      input: "gradients_squeeze_grad_shape_cudnnrnn"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Squeeze_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Squeeze_grad/Reshape"
      op: "Reshape"
      input: "gradients/grad_ys_2:output:0"
      input: "gradients/Squeeze_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Squeeze_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/Squeeze_1_grad/Shape"
      op: "Shape"
      input: "gradients_squeeze_1_grad_shape_cudnnrnn"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Squeeze_1_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Squeeze_1_grad/Reshape"
      op: "Reshape"
      input: "gradients/grad_ys_3:output:0"
      input: "gradients/Squeeze_1_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Squeeze_1_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/AddN"
      op: "AddN"
      input: "gradients/strided_slice_grad/StridedSliceGrad:output:0"
      input: "gradients/transpose_9_grad/transpose:y:0"
      attr {
        key: "N"
        value {
          i: 2
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "_class"
        value {
          list {
            s: "loc:@gradients/strided_slice_grad/StridedSliceGrad"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/AddN"
      }
    }
    node_def {
      name: "gradients/zeros_like"
      op: "ZerosLike"
      input: "gradients_zeros_like_cudnnrnn"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/zeros_like"
      }
    }
    node_def {
      name: "gradients/CudnnRNN_grad/CudnnRNNBackprop"
      op: "CudnnRNNBackprop"
      input: "gradients_cudnnrnn_grad_cudnnrnnbackprop_transpose"
      input: "gradients_cudnnrnn_grad_cudnnrnnbackprop_expanddims"
      input: "gradients_cudnnrnn_grad_cudnnrnnbackprop_expanddims_1"
      input: "gradients_cudnnrnn_grad_cudnnrnnbackprop_concat_1"
      input: "gradients_strided_slice_grad_shape_cudnnrnn"
      input: "gradients_squeeze_grad_shape_cudnnrnn"
      input: "gradients_squeeze_1_grad_shape_cudnnrnn"
      input: "gradients/AddN:sum:0"
      input: "gradients/Squeeze_grad/Reshape:output:0"
      input: "gradients/Squeeze_1_grad/Reshape:output:0"
      input: "gradients_zeros_like_cudnnrnn"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "direction"
        value {
          s: "unidirectional"
        }
      }
      attr {
        key: "dropout"
        value {
          f: 0.0
        }
      }
      attr {
        key: "input_mode"
        value {
          s: "linear_input"
        }
      }
      attr {
        key: "rnn_mode"
        value {
          s: "lstm"
        }
      }
      attr {
        key: "seed"
        value {
          i: 0
        }
      }
      attr {
        key: "seed2"
        value {
          i: 0
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/CudnnRNN_grad/CudnnRNNBackprop"
      }
    }
    node_def {
      name: "gradients/transpose_grad/InvertPermutation"
      op: "InvertPermutation"
      input: "gradients_transpose_grad_invertpermutation_transpose_perm"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/transpose_grad/InvertPermutation"
      }
    }
    node_def {
      name: "gradients/transpose_grad/transpose"
      op: "Transpose"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:input_backprop:0"
      input: "gradients/transpose_grad/InvertPermutation:y:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tperm"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/transpose_grad/transpose"
      }
    }
    node_def {
      name: "gradients/ExpandDims_grad/Shape"
      op: "Shape"
      input: "gradients_expanddims_grad_shape_init_h"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/ExpandDims_grad/Shape"
      }
    }
    node_def {
      name: "gradients/ExpandDims_grad/Reshape"
      op: "Reshape"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:input_h_backprop:0"
      input: "gradients/ExpandDims_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/ExpandDims_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/ExpandDims_1_grad/Shape"
      op: "Shape"
      input: "gradients_expanddims_1_grad_shape_init_c"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "out_type"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/ExpandDims_1_grad/Shape"
      }
    }
    node_def {
      name: "gradients/ExpandDims_1_grad/Reshape"
      op: "Reshape"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:input_c_backprop:0"
      input: "gradients/ExpandDims_1_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/ExpandDims_1_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Rank"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Rank"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/mod"
      op: "FloorMod"
      input: "gradients_concat_1_grad_mod_concat_1_axis"
      input: "gradients/concat_1_grad/Rank:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/mod"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_1"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_2"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_3"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_3"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_4"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 900
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_4"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_5"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 900
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_5"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_6"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 900
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_6"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_7"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 900
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_7"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_8"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_8"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_9"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_9"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_10"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_10"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_11"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_11"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_12"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_12"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_13"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_13"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_14"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_14"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Shape_15"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 30
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Shape_15"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/ConcatOffset"
      op: "ConcatOffset"
      input: "gradients/concat_1_grad/mod:z:0"
      input: "gradients/concat_1_grad/Shape:output:0"
      input: "gradients/concat_1_grad/Shape_1:output:0"
      input: "gradients/concat_1_grad/Shape_2:output:0"
      input: "gradients/concat_1_grad/Shape_3:output:0"
      input: "gradients/concat_1_grad/Shape_4:output:0"
      input: "gradients/concat_1_grad/Shape_5:output:0"
      input: "gradients/concat_1_grad/Shape_6:output:0"
      input: "gradients/concat_1_grad/Shape_7:output:0"
      input: "gradients/concat_1_grad/Shape_8:output:0"
      input: "gradients/concat_1_grad/Shape_9:output:0"
      input: "gradients/concat_1_grad/Shape_10:output:0"
      input: "gradients/concat_1_grad/Shape_11:output:0"
      input: "gradients/concat_1_grad/Shape_12:output:0"
      input: "gradients/concat_1_grad/Shape_13:output:0"
      input: "gradients/concat_1_grad/Shape_14:output:0"
      input: "gradients/concat_1_grad/Shape_15:output:0"
      attr {
        key: "N"
        value {
          i: 16
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/ConcatOffset"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:0"
      input: "gradients/concat_1_grad/Shape:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_1"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:1"
      input: "gradients/concat_1_grad/Shape_1:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_1"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_2"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:2"
      input: "gradients/concat_1_grad/Shape_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_2"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_3"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:3"
      input: "gradients/concat_1_grad/Shape_3:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_3"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_4"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:4"
      input: "gradients/concat_1_grad/Shape_4:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_4"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_5"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:5"
      input: "gradients/concat_1_grad/Shape_5:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_5"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_6"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:6"
      input: "gradients/concat_1_grad/Shape_6:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_6"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_7"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:7"
      input: "gradients/concat_1_grad/Shape_7:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_7"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_8"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:8"
      input: "gradients/concat_1_grad/Shape_8:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_8"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_9"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:9"
      input: "gradients/concat_1_grad/Shape_9:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_9"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_10"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:10"
      input: "gradients/concat_1_grad/Shape_10:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_10"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_11"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:11"
      input: "gradients/concat_1_grad/Shape_11:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_11"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_12"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:12"
      input: "gradients/concat_1_grad/Shape_12:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_12"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_13"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:13"
      input: "gradients/concat_1_grad/Shape_13:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_13"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_14"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:14"
      input: "gradients/concat_1_grad/Shape_14:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_14"
      }
    }
    node_def {
      name: "gradients/concat_1_grad/Slice_15"
      op: "Slice"
      input: "gradients/CudnnRNN_grad/CudnnRNNBackprop:params_backprop:0"
      input: "gradients/concat_1_grad/ConcatOffset:offset:15"
      input: "gradients/concat_1_grad/Shape_15:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/concat_1_grad/Slice_15"
      }
    }
    node_def {
      name: "gradients/Reshape_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\036\000\000\000\001\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Reshape_grad/Reshape"
      op: "Reshape"
      input: "gradients/concat_1_grad/Slice:output:0"
      input: "gradients/Reshape_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/Reshape_1_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\036\000\000\000\001\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_1_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Reshape_1_grad/Reshape"
      op: "Reshape"
      input: "gradients/concat_1_grad/Slice_1:output:0"
      input: "gradients/Reshape_1_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_1_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/Reshape_2_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\036\000\000\000\001\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_2_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Reshape_2_grad/Reshape"
      op: "Reshape"
      input: "gradients/concat_1_grad/Slice_2:output:0"
      input: "gradients/Reshape_2_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_2_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/Reshape_3_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\036\000\000\000\001\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_3_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Reshape_3_grad/Reshape"
      op: "Reshape"
      input: "gradients/concat_1_grad/Slice_3:output:0"
      input: "gradients/Reshape_3_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_3_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/Reshape_4_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\036\000\000\000\036\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_4_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Reshape_4_grad/Reshape"
      op: "Reshape"
      input: "gradients/concat_1_grad/Slice_4:output:0"
      input: "gradients/Reshape_4_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_4_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/Reshape_5_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\036\000\000\000\036\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_5_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Reshape_5_grad/Reshape"
      op: "Reshape"
      input: "gradients/concat_1_grad/Slice_5:output:0"
      input: "gradients/Reshape_5_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_5_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/Reshape_6_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\036\000\000\000\036\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_6_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Reshape_6_grad/Reshape"
      op: "Reshape"
      input: "gradients/concat_1_grad/Slice_6:output:0"
      input: "gradients/Reshape_6_grad/Shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_6_grad/Reshape"
      }
    }
    node_def {
      name: "gradients/Reshape_7_grad/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\036\000\000\000\036\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "gradients/Reshape_7_grad/Shape"
      }
    }
    node_def {
      name: "gradients/Reshape_7_grad/Reshape"
      op: "Reshape"
      input: "gradients/concat_1_grad/Slice_7:output:0"
      input: "gradients/Reshape_7_grad/Shape:output:0"
      attr {
        key: "T"
        value {
